<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[Paesa Blog]]></title><description><![CDATA[Programación, Software, Seguridad, Privacidad y otras cosas.]]></description><link>https://blog.paesa.es/</link><image><url>https://blog.paesa.es/favicon.png</url><title>Paesa Blog</title><link>https://blog.paesa.es/</link></image><generator>Ghost 5.19</generator><lastBuildDate>Thu, 20 Oct 2022 22:39:38 GMT</lastBuildDate><atom:link href="https://blog.paesa.es/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[Ayuda a evadir la censura en Internet con Snowflake]]></title><description><![CDATA[Ayuda a otros usuarios por todo el planeta a evadir la censura en Internet instalando la extensión Snowflake en tu navegador.]]></description><link>https://blog.paesa.es/evadir-censura-snowflake/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fe5</guid><category><![CDATA[censura]]></category><category><![CDATA[privacidad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Fri, 04 Mar 2022 13:39:31 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/snowflake-schematic.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/snowflake-schematic.webp" alt="Ayuda a evadir la censura en Internet con Snowflake"><p>La censura en Internet mediante el bloqueo o la limitaci&#xF3;n del acceso al contenido online es una tendencia creciente especialmente en pa&#xED;ses con gobiernos autocr&#xE1;ticos o totalitarias como una forma de controlar el discurso pol&#xED;tico y minar los esfuerzos de disidentes y periodistas. China, Ir&#xE1;n, Rusia o Turqu&#xED;a son ejemplos de pa&#xED;ses con altos niveles de censura en la red.</p><h3 id="la-red-tor">La red Tor</h3><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/tor-network-diag.webp" class="kg-image" alt="Ayuda a evadir la censura en Internet con Snowflake" loading="lazy" width="1298" height="938" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/tor-network-diag.webp 600w, https://blog.paesa.es/content/images/size/w1000/2022/05/tor-network-diag.webp 1000w, https://blog.paesa.es/content/images/2022/05/tor-network-diag.webp 1298w" sizes="(min-width: 720px) 720px"><figcaption>Funcionamiento de la red Tor</figcaption></figure><p>Una de las mejores herramientas que existen para acceder a Internet de forma privada y an&#xF3;nima es la red Tor, una red de servidores por todo el planeta mantenidos por voluntarios. La red Tor transmite la informaci&#xF3;n por tres nodos distintos de la red utilizando varias capas de cifrado antes de enviarla a su destino final, este mecanismo asegura la anonimidad del usuario y le permite navegar sin censura.</p><p>Esto convierte a la red Tor en un objetivo prioritario para los censores, los nodos de la red pueden ser identificados y el acceso a ellos limitado o bloqueado.</p><p>Una de las estrategias desarrolladas para evadir ese bloqueo es el uso de &quot;puentes&quot; o intermediarios que no puedan ser f&#xE1;cilmente identificados y bloqueados por los sistemas de censura.</p><h3 id="snowflake">Snowflake</h3><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2022-03-04-143714.jpg" class="kg-image" alt="Ayuda a evadir la censura en Internet con Snowflake" loading="lazy" width="410" height="312"><figcaption>Snowflake instalado y funcionando</figcaption></figure><p><a href="https://snowflake.torproject.org/">Snowflake</a> es una herramienta creada para hacer exactamente eso, ser intermediario entre los usuarios en zonas con Internet censurado y los nodos de la red Tor.</p><p>Es una extensi&#xF3;n para navegadores web que puedes instalar para hacer que tu PC forme parte de la red de intermediarios y ayudar a otros usuarios por todo el planeta a acceder a la red Tor.</p><p>No supone ning&#xFA;n riesgo para la privacidad del usuario, no tienes que configurar nada y consume muy poco ancho de banda.</p><p><a href="https://chrome.google.com/webstore/detail/snowflake/mafpmfcccpbjnhfhjnllmmalhifmlcie">Instalar en Chrome</a></p><p><a href="https://addons.mozilla.org/en-US/firefox/addon/torproject-snowflake/">Instalar en Firefox</a></p>]]></content:encoded></item><item><title><![CDATA[Copias de seguridad en WhatsApp cifradas de extremo a extremo]]></title><description><![CDATA[Activa las copias de seguridad cifradas de extremo a extremo de los chats de Whatsapp para tener un respaldo seguro y privado en la nube.]]></description><link>https://blog.paesa.es/copias-de-seguridad-cifradas-en-whatsapp/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fe1</guid><category><![CDATA[privacidad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Tue, 08 Feb 2022 16:58:30 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/alexander-shatov-_qsuER9xYOY-unsplash-2.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/alexander-shatov-_qsuER9xYOY-unsplash-2.webp" alt="Copias de seguridad en WhatsApp cifradas de extremo a extremo"><p>En septiembre de 2021, Facebook, ahora llamado Meta y propietario de Whatsapp LLC anunci&#xF3; que implementar&#xED;a copias de seguridad de los chats de Whatsapp con cifrado de extremo a extremo (E2EE). </p><p>Desde 2015 Whatsapp cifra todos los mensajes que env&#xED;an los usuarios utilizando E2EE, eso significa que cada mensaje es cifrado en el dispositivo del emisor con una clave que pertenece al receptor y solo &#xE9;l puede descifrarlo, esto otorga unos grandes beneficios en seguridad y privacidad a los usuarios ya que un tercero, sea este Whatsapp, Facebook, Meta o quien sea no puede ver el contenido de los mensajes aunque estos pasen por sus servidores.</p><p>Una funcionalidad que ofrecen muchas apps de mensajer&#xED;a como Whatsapp es hacer copias de seguridad de los mensajes de tu dispositivo para que en caso de p&#xE9;rdida o da&#xF1;o puedas recuperar todas las conversaciones. Para esto utiliza el servicio de almacenamiento en la nube que ofrece cada plataforma m&#xF3;vil, Google Drive en Android y iCloud en iOS. Tambi&#xE9;n hay un acuerdo entre Whatsapp y estos servicios para que esas copias de seguridad no cuenten como espacio utilizado en tu cuenta de Drive o iCloud. Eso est&#xE1; muy bien &#xBF;No?</p><p>S&#xED;, pero tiene un problema de dise&#xF1;o, esa copia de seguridad que se almacena fuera de tu dispositivo <strong>NO</strong> est&#xE1; cifrada.</p><p>A final de 2021, Whatsapp anunci&#xF3; que esta funcionalidad ya estaba lista e ir&#xED;a activando esa opci&#xF3;n a los usuarios de forma progresiva.</p><h2 id="%C2%BFpor-qu%C3%A9-deber%C3%ADa-activar-las-copias-de-seguridad-cifradas">&#xBF;Por qu&#xE9; deber&#xED;a activar las copias de seguridad cifradas? </h2><p>Mayor seguridad y privacidad son las principales razones, los chats y conversaciones suelen contener mucha informaci&#xF3;n privada o sensible que seguro que quieres mantener protegida. Conversaciones con amigos, familiares, parejas... dentro de ellas puedes encontrarte recibos, documentos (DNI o similar), incluso fotos &#xED;ntimas (s&#xED;, hay gente que manda eso). Eso permitir&#xED;a a un ciberdelincuente poder suplantar tu identidad o chantajearte con hacer p&#xFA;blicas conversaciones y/o fotos privadas.</p><p> Seguro que has o&#xED;do casos de personalidades famosas que han acabado con conversaciones privadas o fotos &#xED;ntimas publicadas en la red. &#xBF;C&#xF3;mo acabaron en manos de un delincuente? Muy sencillo, accedieron a sus cuentas de iCloud utilizando un ataque de phishing (una web o email haci&#xE9;ndose pasar por esa empresa y enga&#xF1;ar al usuario para que introduzca sus credenciales) y lo descargaron todo.</p><h2 id="%C2%BFc%C3%B3mo-funciona">&#xBF;C&#xF3;mo funciona?</h2><p>Cuando activas la copia de seguridad de extremo a extremo lo primero que te pide la aplicaci&#xF3;n es que introduzcas una contrase&#xF1;a o guardes una clave de 64 d&#xED;gitos que genera la aplicaci&#xF3;n. Esta clave es que la utilizar&#xE1; para cifrar el contenido de la copia de seguridad antes de enviarla a la nube.</p><p>Primero veamos los dos modos de funcionamiento y despu&#xE9;s como activarlas en tu tel&#xE9;fono.</p><h3 id="utilizando-una-contrase%C3%B1a-creada-por-el-usuario">Utilizando una contrase&#xF1;a creada por el usuario</h3><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/e2ee-user-password.webp" class="kg-image" alt="Copias de seguridad en WhatsApp cifradas de extremo a extremo" loading="lazy" width="1536" height="864" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/e2ee-user-password.webp 600w, https://blog.paesa.es/content/images/size/w1000/2022/05/e2ee-user-password.webp 1000w, https://blog.paesa.es/content/images/2022/05/e2ee-user-password.webp 1536w" sizes="(min-width: 720px) 720px"></figure><p>La aplicaci&#xF3;n de Whatsapp genera una clave de cifrado y esta es protegida con una contrase&#xF1;a proporcionada por el usuario. La clave se almacena en un servidor de Whatsapp y se desbloquea con la contrase&#xF1;a.</p><h3 id="utilizando-una-clave-de-64-d%C3%ADgitos-generada-por-whatsapp">Utilizando una clave de 64 d&#xED;gitos generada por Whatsapp</h3><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/e2ee-encryption-key.webp" class="kg-image" alt="Copias de seguridad en WhatsApp cifradas de extremo a extremo" loading="lazy" width="1536" height="864" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/e2ee-encryption-key.webp 600w, https://blog.paesa.es/content/images/size/w1000/2022/05/e2ee-encryption-key.webp 1000w, https://blog.paesa.es/content/images/2022/05/e2ee-encryption-key.webp 1536w" sizes="(min-width: 720px) 720px"></figure><p>En este m&#xE9;todo la aplicaci&#xF3;n genera la clave de cifrado y es el usuario el que tiene la responsabilidad de guardarla y protegerla.</p><h2 id="activar-las-copias-e2ee">Activar las copias E2EE</h2><p>El m&#xE9;todo m&#xE1;s sencillo es configurar las copias E2EE con una contrase&#xF1;a del usuario y que la clave de cifrado se guarde en un m&#xF3;dulo de seguridad en un servidor de WhatsApp.</p><p>Primero ves a WhatsApp --&gt; Ajustes --&gt; Chats --&gt; Copia de seguridad. Si no aparece la secci&#xF3;n &quot;Copia de seguridad cifrada de extremo a extremo&quot; significa que aun no esta activada para tu cuenta.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/1644332162696--Blog-.jpg" class="kg-image" alt="Copias de seguridad en WhatsApp cifradas de extremo a extremo" loading="lazy" width="450" height="783"></figure><p>Pulsa sobre &quot;Copia de seguridad cifrada de extremo a extremo&quot; para iniciar el asistente de configuraci&#xF3;n.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/1644332162703--Blog-.jpg" class="kg-image" alt="Copias de seguridad en WhatsApp cifradas de extremo a extremo" loading="lazy" width="397" height="800"></figure><p>Pulsa &quot;Activar&quot;.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/1644332162717--Blog-.jpg" class="kg-image" alt="Copias de seguridad en WhatsApp cifradas de extremo a extremo" loading="lazy" width="393" height="800"></figure><p>Aqu&#xED; puedes elegir una de las dos opciones que hemos visto anteriormente. Esta contrase&#xF1;a es la que necesitaras si quieres restaurar la copia de seguridad en alg&#xFA;n momento. Gu&#xE1;rdala.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/1644332162724--Blog-.jpg" class="kg-image" alt="Copias de seguridad en WhatsApp cifradas de extremo a extremo" loading="lazy" width="383" height="800"></figure><p>Al finalizar la configuraci&#xF3;n podr&#xE1;s crear una copia de seguridad con cifrado de extremo a extremo.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/1644332162731--Blog-.jpg" class="kg-image" alt="Copias de seguridad en WhatsApp cifradas de extremo a extremo" loading="lazy" width="450" height="751"></figure><p>Ya tienes un respaldo seguro y privado de todos tus chats de WhatsApp.</p>]]></content:encoded></item><item><title><![CDATA[Activa el DNS Privado en Android]]></title><description><![CDATA[Activa el DNS Privado en Android para tener conexiones más seguras y privadas en Internet.]]></description><link>https://blog.paesa.es/dns-seguro-en-android/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fe2</guid><category><![CDATA[android]]></category><category><![CDATA[privacidad]]></category><category><![CDATA[seguridad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Sat, 08 Jan 2022 23:00:00 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/android-dot.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/android-dot.webp" alt="Activa el DNS Privado en Android"><p>El protocolo DNS (Domain Name System) es un pilar fundamental de Internet que traduce los nombres de dominio como google.com o twitter.com a direcciones IP como 142.250.178.174 o 104.244.42.1.</p><h3 id="%C2%BFqu%C3%A9-es-el-dns">&#xBF;Qu&#xE9; es el DNS?</h3><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/dns-agenda.webp" class="kg-image" alt="Activa el DNS Privado en Android" loading="lazy" width="1400" height="800" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/dns-agenda.webp 600w, https://blog.paesa.es/content/images/size/w1000/2022/05/dns-agenda.webp 1000w, https://blog.paesa.es/content/images/2022/05/dns-agenda.webp 1400w" sizes="(min-width: 720px) 720px"></figure><p>Todos los dispositivos conectados a Internet (o cualquier red) se identifican con una direcci&#xF3;n IP &#xFA;nica que otros utilizan para encontrarlo, sin embargo, utilizar direcciones IP para referirse a los distintos dispositivos o recursos en una red introduce varios inconvenientes y limitaciones, son muy dif&#xED;ciles de utilizar y recordar para un ser humano.</p><p>El sistema DNS funciona como una agenda de contactos para todas las direcciones de Internet que traduce nombres alfanum&#xE9;ricos f&#xE1;ciles de utilizar por los humanos pero que no aportan la informaci&#xF3;n que necesita una m&#xE1;quina para saber a donde tiene que comunicarse, a una direcci&#xF3;n en el protocolo IP utilizado por todos los dispositivos y routers para saber como tienen que transmitir la informaci&#xF3;n para que llegue al destinatario.</p><p>Pr&#xE1;cticamente todas las comunicaciones en Internet empiezan con una consulta DNS, visitar cualquier sitio web, ver un v&#xED;deo en Netflix, enviar un mensaje por WhatsApp, descargar una aplicaci&#xF3;n... Lo primero que hace tu dispositivo es una consulta a un servidor DNS (proporcionado por tu proveedor de Internet) para saber la direcci&#xF3;n IP de ese sitio o servicio y as&#xED; poder establecer una conexi&#xF3;n y transmitir y recibir informaci&#xF3;n.</p><h3 id="seguridad-en-el-protocolo-dns">Seguridad en el protocolo DNS</h3><p>El protocolo DNS se remonta a los inicios de Internet en los a&#xF1;os 80, eso significa que la seguridad e integridad de la informaci&#xF3;n no fueron consideradas al dise&#xF1;ar el protocolo ya que se creo para facilitar el uso de esas primeras redes en centros de investigaci&#xF3;n y universidades. Nunca se pens&#xF3; en el crecimiento y la escala global que iban a tener esas tecnolog&#xED;as en las pr&#xF3;ximas d&#xE9;cadas, la dependencia que tendr&#xED;an las comunicaciones, econom&#xED;a y la sociedad en general en su correcto funcionamiento.</p><p>La comunicaci&#xF3;n entre un cliente (tu dispositivo) y un servidor DNS se realiza en plano, es decir, no utiliza ning&#xFA;n tipo de cifrado ni autenticaci&#xF3;n para garantizar que la informaci&#xF3;n no puede ser vista o alterada por un atacante situado entre ambos.</p><p>Mientras que otros protocolos como HTTP (utilizado para transmitir p&#xE1;ginas web) ha incluido una capa de cifrado y autenticaci&#xF3;n de datos que da lugar a HTTPS &#x2013;ahora ya omnipresente&#x2013; &#xA0;DNS se ha quedado atr&#xE1;s durante a&#xF1;os. </p><h3 id="dns-sobre-tls">DNS sobre TLS</h3><p>DNS sobre TLS es un nuevo protocolo que encapsula las peticiones DNS en una capa de seguridad con cifrado y autenticaci&#xF3;n de datos. Incluido en Android desde Android 9 (Pie), es muy sencillo de configurar y activar para tener una conexi&#xF3;n m&#xE1;s segura.</p><p>La ubicaci&#xF3;n exacta del ajuste para configurar el DNS privado puede variar ligeramente dependiendo de la versi&#xF3;n y el fabricante del dispositivo.</p><p>Primero ves a la aplicaci&#xF3;n de <strong>Ajustes </strong>y entra a la secci&#xF3;n <strong>Conexi&#xF3;n y Compartir</strong>.</p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/1641619176643--Small.webp" class="kg-image" alt="Activa el DNS Privado en Android" loading="lazy" width="424" height="574"><figcaption>Men&#xFA; Ajustes del sistema</figcaption></figure><p>Ah&#xED; encontraras la opci&#xF3;n <strong>DNS privado.</strong></p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/1641619176636--Small.webp" class="kg-image" alt="Activa el DNS Privado en Android" loading="lazy" width="360" height="600"><figcaption>Opci&#xF3;n de DNS Privado</figcaption></figure><p>Si no te aparece la opci&#xF3;n <strong>DNS privado</strong> seguramente tu dispositivo sea un Android anterior a la versi&#xF3;n 9.</p><p><strong>DNS Privado</strong> tiene tres modos de funcionamiento:</p><!--kg-card-begin: markdown--><ul>
<li>Desactivado: Desactiva el uso de DNS sobre TLS.</li>
<li>Autom&#xE1;tico: Utiliza DNS sobre TLS si tu proveedor actual (de Internet) lo soporta.</li>
<li>Nombre de host del proveedor de DNS privado: Te permite especificar un proveedor que soporte DNS sobre TLS.</li>
</ul>
<!--kg-card-end: markdown--><p>No conozco ning&#xFA;n proveedor de Internet en Espa&#xF1;a que sus servidores DNS soporten DNS sobre TLS, supongo que adoptar protocolos m&#xE1;s seguros no es una prioridad para ellos.</p><p>As&#xED; que solo queda la opci&#xF3;n de especificar un proveedor DNS que tenga soporte para DNS sobre TLS. Los principales candidatos son <a href="https://developers.google.com/speed/public-dns/">Google</a>, <a href="https://www.quad9.net/">Quad9</a> y <a href="https://www.cloudflare.com/">Cloudflare</a>.</p><!--kg-card-begin: markdown--><ul>
<li>Google --&gt; dns.google.com</li>
<li>Quad9 --&gt; dns.quad9.net</li>
<li>Cloudflare --&gt; one.one.one.one</li>
</ul>
<!--kg-card-end: markdown--><p>Cloudflare tiene la <a href="https://www.cloudflare.com/network/">red m&#xE1;s grande</a> (&gt;200 servidores por todo el mundo) y su servicio DNS es el m&#xE1;s r&#xE1;pido. Ah, y no est&#xE1; en el negocio de los datos personales como Google.</p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/164053965792.webp" class="kg-image" alt="Activa el DNS Privado en Android" loading="lazy" width="424" height="600"><figcaption>Configurar DNS de Cloudflare</figcaption></figure><p>Al activarlo todo el tr&#xE1;fico DNS que env&#xED;e tu dispositivo estar&#xE1; protegido.</p>]]></content:encoded></item><item><title><![CDATA[NewPipe - Más YouTube y menos anuncios]]></title><description><![CDATA[NewPipe es un cliente alternativo de YouTube para Android con más funcionalidades y ningún anuncio en los videos.]]></description><link>https://blog.paesa.es/newpipe-youtube-anuncios/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fe0</guid><category><![CDATA[anuncios]]></category><category><![CDATA[android]]></category><category><![CDATA[privacidad]]></category><category><![CDATA[publicidad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Wed, 22 Dec 2021 13:48:21 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/alexander-shatov-niUkImZcSP8-unsplash.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/alexander-shatov-niUkImZcSP8-unsplash.webp" alt="NewPipe - M&#xE1;s YouTube y menos anuncios"><p>YouTube es de los servicios m&#xE1;s utilizados para ver contenido en Internet, cada d&#xED;a se visualizan millones de horas &#x2013;muchas de ellas anuncios&#x2013; de contenido en la plataforma en todo el mundo.</p><h3 id="%C2%BFqu%C3%A9-es-newpipe">&#xBF;Qu&#xE9; es NewPipe?</h3><p>NewPipe es un cliente alternativo gratuito y c&#xF3;digo abierto para YouTube en Android. Ofrece muchas funcionalidades de las que la app oficial carece (en su versi&#xF3;n gratuita) como descargar videos para verlos en otro momento, reproducir solo audio en segundo plano... Ah y tambi&#xE9;n reproduce todos los videos sin ning&#xFA;n anuncio ni contenido promocional, ni al comienzo ni a mitad del contenido. Simplemente ves el contenido que quieres ver y punto.</p><p>NewPipe es una app m&#xE1;s ligera (consume menos recursos) y m&#xE1;s privada ya que no utiliza APIs propietarias de Google y solo env&#xED;a la informaci&#xF3;n imprescindible a YouTube para poder usar el servicio. Tambi&#xE9;n te puede ayudar a ahorrar bater&#xED;a y datos m&#xF3;viles reproduciendo &#xFA;nicamente el audio en segundo.</p><p>NewPipe no utiliza ni te pedir&#xE1; que inicies sesi&#xF3;n con tu cuenta de YouTube, eso tiene ventajas como desvincular el uso de NewPipe de tu cuenta pero tiene desventajas como no tener recomendaciones personalizadas de los canales que sigues o los temas que te interesan. Siempre puedes usar la app de YouTube para descubrir videos y a la hora de reproducirlos lo env&#xED;as a NewPipe con la funcionalidad de compartir para que el video pase a reproducirse en NewPipe.</p><p>Adem&#xE1;s sirve como cliente para otros servicios como SoundCloud o PeerTube.</p><h3 id="descargar-newpipe">Descargar NewPipe</h3><p>No la encontrar&#xE1;s en la Play Store &#x2013;Google jam&#xE1;s lo permitir&#xED;a&#x2013; pero puedes descargarla desde la web oficial <a href="https://newpipe.net/">NewPipe - a free YouTube client</a> o desde una tienda de aplicaciones alternativa como <a href="https://f-droid.org/">F-Droid</a>.</p><p>Lo m&#xE1;s recomendable es instalar <a href="https://f-droid.org/">F-Droid</a> y desde ah&#xED; instalar NewPipe, as&#xED; recibir&#xE1;s actualizaciones, de la otra forma tendr&#xED;as que instalarla manualmente cada nueva versi&#xF3;n</p><h3 id="%C2%BFtiene-alg%C3%BAn-riesgo-utilizar-newpipe">&#xBF;Tiene alg&#xFA;n riesgo utilizar NewPipe?</h3><p>Nope. Siempre que te asegures de descargarla de la web oficial o de F-Droid y no instales una copia maliciosa de otro lugar.</p><p>NewPipe no est&#xE1; en la Google Play Store porque sus desarrolladores saben que ser&#xED;a retirada por Google alegando que viola los t&#xE9;rminos de uso de la Play Store y puede que de YouTube. Eso no significa que la app haga algo problem&#xE1;tico o ilegal, simplemente no utiliza esos servicios de acuerdo a los t&#xE9;rminos de uso.</p>]]></content:encoded></item><item><title><![CDATA[Apúntate a la lista Robinson y deja de recibir llamadas publicitarias]]></title><description><![CDATA[<p>Todos hemos recibido esas molestas llamadas en las que un operador telef&#xF3;nico quiere vendernos algo, sea un servicio de internet y telefon&#xED;a, un seguro del hogar... Hacernos un par de preguntas para una &quot;encuesta&quot; que principalmente tienen como objetivo tener m&#xE1;s informaci&</p>]]></description><link>https://blog.paesa.es/lista-robinson/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fdf</guid><category><![CDATA[anuncios]]></category><category><![CDATA[publicidad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Fri, 26 Nov 2021 13:59:00 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/tom-winckels-I7oLRdM9YIw-unsplash.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/tom-winckels-I7oLRdM9YIw-unsplash.webp" alt="Ap&#xFA;ntate a la lista Robinson y deja de recibir llamadas publicitarias"><p>Todos hemos recibido esas molestas llamadas en las que un operador telef&#xF3;nico quiere vendernos algo, sea un servicio de internet y telefon&#xED;a, un seguro del hogar... Hacernos un par de preguntas para una &quot;encuesta&quot; que principalmente tienen como objetivo tener m&#xE1;s informaci&#xF3;n sobre ti para usarla en futuras campa&#xF1;as publicitarias.</p><p>&#xBF;Se puede hacer algo para dejar de recibir este tipo de llamadas?</p><p>S&#xED;, existe una lista voluntaria para ser excluido de campa&#xF1;as publicitarias de empresas a las que no has dado consentimiento para ello. Se llama &quot;<a href="https://www.listarobinson.es/">Lista Robinson</a>&quot; y es de obligado cumplimiento para las empresas, es decir, tienen la obligaci&#xF3;n legal de consultar la lista y si estas inscrito, no pueden enviarte publicidad.</p><p>La <a href="https://www.listarobinson.es/">Lista Robinson</a> es gestionada por la <a href="https://www.adigital.org/">Asociaci&#xF3;n Espa&#xF1;ola de Econom&#xED;a Digital</a> y para apuntarte s&#xF3;lo tienes que registrarte en la <a href="https://www.listarobinson.es/">web</a> y especificar los medios por los que no quieres recibir publicidad (tel&#xE9;fono, correo postal, correo electr&#xF3;nico o SMS).</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/07/Captura-de-pantalla-2022-07-13-064257.jpg" class="kg-image" alt="Ap&#xFA;ntate a la lista Robinson y deja de recibir llamadas publicitarias" loading="lazy" width="1239" height="673" srcset="https://blog.paesa.es/content/images/size/w600/2022/07/Captura-de-pantalla-2022-07-13-064257.jpg 600w, https://blog.paesa.es/content/images/size/w1000/2022/07/Captura-de-pantalla-2022-07-13-064257.jpg 1000w, https://blog.paesa.es/content/images/2022/07/Captura-de-pantalla-2022-07-13-064257.jpg 1239w" sizes="(min-width: 720px) 720px"></figure><p>Una vez est&#xE9;s inscrito y tengas registrado tu tel&#xE9;fono, correo electr&#xF3;nico... ser&#xE1;s autom&#xE1;ticamente excluido de futuras campa&#xF1;as publicitarias, puede que sigas recibiendo llamadas publicitarias o correos de las campa&#xF1;as que ya estaban en curso en el momento en el que te inscribiste, pero en un par de semanas ser&#xE1; plenamente efectiva.</p><p>Si contin&#xFA;as recibiendo llamadas promocionales de alguna empresa, ret&#xED;rales el consentimiento (si lo tienen) y hazles saber que estas inscrito en la lista de exclusi&#xF3;n publicitaria y que no pueden llamarte.</p>]]></content:encoded></item><item><title><![CDATA[Bloquea los anuncios y el contenido promocionado en Twitter]]></title><description><![CDATA[<p>Con <a href="https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm">Ublock Origin</a> instalado en el navegador para bloquear anuncios y rastreadores en las webs y un servicio <a href="https://milgradesec.github.io/paesadns/">DNS</a> para bloquearlos en el resto del sistema ya solo queda enfrentarse a las webs/aplicaciones que no son afectadas por estas medidas y est&#xE1;n empe&#xF1;adas en molestarnos</p>]]></description><link>https://blog.paesa.es/twitter-sin-anuncios/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fde</guid><category><![CDATA[anuncios]]></category><category><![CDATA[android]]></category><category><![CDATA[privacidad]]></category><category><![CDATA[publicidad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Wed, 03 Nov 2021 17:01:38 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/alexander-shatov-k1xf2D7jWUs-unsplash.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/alexander-shatov-k1xf2D7jWUs-unsplash.webp" alt="Bloquea los anuncios y el contenido promocionado en Twitter"><p>Con <a href="https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm">Ublock Origin</a> instalado en el navegador para bloquear anuncios y rastreadores en las webs y un servicio <a href="https://milgradesec.github.io/paesadns/">DNS</a> para bloquearlos en el resto del sistema ya solo queda enfrentarse a las webs/aplicaciones que no son afectadas por estas medidas y est&#xE1;n empe&#xF1;adas en molestarnos con anuncios y contenido promocionado mientras las utilizamos. </p><p>Ah y tambi&#xE9;n se llevan todos los datos que pueden sobre nosotros para vender esos espacios publicitarios al mejor postor. Entre ellas ya tengo posts sobre <a href="https://blog.paesa.es/spotify-sin-anuncios/">Spotify</a> y <a href="https://blog.paesa.es/bloquear-anuncios-en-twitch-tv/">Twitch.tv</a>. </p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/twitter-ads.webp" class="kg-image" alt="Bloquea los anuncios y el contenido promocionado en Twitter" loading="lazy" width="600" height="310" srcset="https://blog.paesa.es/content/images/2022/05/twitter-ads.webp 600w"></figure><p>Para Twitter en PC es muy sencillo, con tener <a href="https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm">Ublock Origin</a> es suficiente. En plataformas m&#xF3;viles es donde empiezan los problemas porque no es tan sencillo tener un bloqueador en el navegador y la app nativa entrega el contenido normal y los anuncios utilizando los mismos servidores, lo que impide bloquearlos utilizando DNS.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/brave.webp" class="kg-image" alt="Bloquea los anuncios y el contenido promocionado en Twitter" loading="lazy" width="1680" height="840" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/brave.webp 600w, https://blog.paesa.es/content/images/size/w1000/2022/05/brave.webp 1000w, https://blog.paesa.es/content/images/size/w1600/2022/05/brave.webp 1600w, https://blog.paesa.es/content/images/2022/05/brave.webp 1680w" sizes="(min-width: 720px) 720px"></figure><p>&#xA1;<a href="https://brave.com/es/">Brave Browser</a> llega al rescate!</p><p><a href="https://brave.com/es/">Brave</a> es un navegador similar a Chrome (comparten el c&#xF3;digo de <a href="https://www.chromium.org/">Chromium</a>) que bloquea los anuncios y rastreadores autom&#xE1;ticamente, reduciendo el consumo de datos m&#xF3;viles y alargando la duraci&#xF3;n de la bater&#xED;a entre otras ventajas.</p><p>Puedes usar la versi&#xF3;n web de Twitter desde <a href="https://brave.com/es/">Brave</a> e instalarla como PWA y ser&#xE1; como una aplicaci&#xF3;n nativa m&#xE1;s.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/brave-twitter-pwa-Small.webp" class="kg-image" alt="Bloquea los anuncios y el contenido promocionado en Twitter" loading="lazy" width="394" height="854"></figure><p>Y a no ser que tengas una muy buena raz&#xF3;n para usar Chrome en Android seguro que disfrutar&#xE1;s de una mejor experiencia en la web utilizando <a href="https://brave.com/es/">Brave</a> como navegador predeterminado.</p>]]></content:encoded></item><item><title><![CDATA[Escucha música en Spotify sin anuncios desde tu PC]]></title><description><![CDATA[Escucha música en Spotify desde tu PC sin ningún anuncio utilizando el reproductor web junto a un bloqueador de anuncios.]]></description><link>https://blog.paesa.es/spotify-sin-anuncios/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fdc</guid><category><![CDATA[anuncios]]></category><category><![CDATA[publicidad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Fri, 22 Oct 2021 01:49:19 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/alexander-shatov-w-qqwn5O-4I-unsplash.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/alexander-shatov-w-qqwn5O-4I-unsplash.webp" alt="Escucha m&#xFA;sica en Spotify sin anuncios desde tu PC"><p>Spotify tiene aplicaciones nativas para todas las plataformas como Android, iOS, Windows, Mac OS e incluso Linux. Lo que no tantos conocen es que tambi&#xE9;n tiene una &#xA0;aplicaci&#xF3;n web completamente funcional que se puede utilizar desde cualquier navegador como Chrome, Edge o Firefox.</p><p>&#xBF;Que ventaja tiene? Que en los navegadores puedes instalar una extensi&#xF3;n que bloquea anuncios como <a href="https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm">Ublock Origin</a>. Y tambi&#xE9;n eliminar&#xE1; los que aparecen en Spotify entre reproducciones.</p><p>Puedes acceder al reproductor web de Spotify desde <a href="https://open.spotify.com/">https://open.spotify.com/</a>. &#xDA;nicamente tienes que iniciar sesi&#xF3;n con tu cuenta y asegurarte de tener un bloqueador de anuncios instalado (recomiendo Ublock) y ya puedes escuchar m&#xFA;sica con el plan gratuito de Spotify mientras estas con el PC sin que te molesten los anuncios. &#x1F609;</p><p>Para una mejor experiencia de uso puedes &apos;instalar&apos; la aplicaci&#xF3;n web para que parezca una nativa m&#xE1;s. Puedes hacerlo desde la barra superior de b&#xFA;squeda o desde el men&#xFA; de configuraci&#xF3;n.</p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2021-10-22-1.webp" class="kg-image" alt="Escucha m&#xFA;sica en Spotify sin anuncios desde tu PC" loading="lazy" width="976" height="634" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/Captura-de-pantalla-2021-10-22-1.webp 600w, https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2021-10-22-1.webp 976w" sizes="(min-width: 720px) 720px"><figcaption>Instalar como aplicaci&#xF3;n desde la barra de b&#xFA;squeda</figcaption></figure><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2021-10-22-033842.webp" class="kg-image" alt="Escucha m&#xFA;sica en Spotify sin anuncios desde tu PC" loading="lazy" width="701" height="585" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/Captura-de-pantalla-2021-10-22-033842.webp 600w, https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2021-10-22-033842.webp 701w"><figcaption>Instalar como aplicaci&#xF3;n desde el men&#xFA;</figcaption></figure><p>As&#xED; te aparecer&#xE1; como una aplicaci&#xF3;n normal instalada pero se ejecutara en el navegador.</p><p>Te preguntar&#xE1;s si se puede hacer esto desde un dispositivo m&#xF3;vil como Android. Spotify quiere que los usuarios m&#xF3;viles instalen y utilicen la aplicaci&#xF3;n nativa y pone m&#xE1;s complicado utilizar la versi&#xF3;n web (YouTube, Facebook y muchos m&#xE1;s hacen lo mismo). Y a eso hay que sumarle que los navegadores m&#xF3;viles son mucho m&#xE1;s limitados en extensiones y bloqueo de contenido. Chrome en Android no sirve porque no tiene ni bloqueador de anuncios integrado (GOOGLE Chrome) ni forma de instalar una extensi&#xF3;n como Ublock Origin. </p><p>Si entras a <a href="https://open.spotify.com/">https://open.spotify.com/</a> desde <a href="https://brave.com/es/">Brave</a> te encontrar&#xE1;s algo como esto:</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/1636566578444-Small.webp" class="kg-image" alt="Escucha m&#xFA;sica en Spotify sin anuncios desde tu PC" loading="lazy" width="394" height="854"></figure><p>As&#xED; que parece que no, no es posible.</p>]]></content:encoded></item><item><title><![CDATA[Desactiva Google FLoC en tu sitio Web]]></title><description><![CDATA[Desactiva en tu sitio Web el uso de la nueva tecnología de Google que clasifica a los usuarios con fines publicitarios.]]></description><link>https://blog.paesa.es/desactivar-google-floc-en-tu-sitio-web/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fdd</guid><category><![CDATA[privacidad]]></category><category><![CDATA[anuncios]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Fri, 02 Jul 2021 16:35:03 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/google-eye.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/google-eye.webp" alt="Desactiva Google FLoC en tu sitio Web"><p>Federated learning of Cohorts (FLoC) es una nueva tecnolog&#xED;a creada por Google para sustituir &#xA0;a las cookies de terceros y permitir a los anunciantes digitales mostrar anuncios personalizados a los usuarios. Es parte de una iniciativa mayor llamada &quot;Privacy Sandbox&quot;, anunciada por Google en 2019 con el objetivo de introducir nuevos est&#xE1;ndares web que sean mas respetuosos con la privacidad de los usuarios, enfoc&#xE1;ndose en las tecnolog&#xED;as utilizadas para rastrear a los usuarios con el objetivo de mostrarles anuncios.</p><p>FloC &#xA0;se basa en clasificar a los usuarios en distintos grupos o cohorts utilizando datos como el historial de navegaci&#xF3;n del usuario, la clave reside en que ese proceso se realice en local, es decir, en el navegador del usuario y esos datos no sean accesibles para rastreadores. </p><p>La mejora de la privacidad que promete es que los anunciantes ya no recopilar&#xED;an tanta informaci&#xF3;n sobre los usuarios para poder clasificarlos y utilizar&#xED;a los resultados de esa clasificaci&#xF3;n local que hace el navegador.</p><p>Esta iniciativa no ha tenido un gran recibimiento que digamos ya que ni Microsoft ni Apple ni Mozilla planean adoptarla y ser&#xE1; Chrome el &#xFA;nico navegador que experimente con ella.</p><p>Tampoco faltan cr&#xED;ticas que acusan a Google de utilizar FloC para monopolizar el negocio de los anuncios digitales privando a la competencia del acceso a datos de navegaci&#xF3;n de los usuarios, lo que ya se ve reflejado en varias demandas contra Google en EEUU por estas iniciativas.</p><p>Si quieres desactivar el uso de FloC en tus sitios web tienes que a&#xF1;adir una cabecera HTTP en las respuestas de tu servidor.</p><!--kg-card-begin: markdown--><pre><code>Permissions-Policy: interest-cohort=()
</code></pre>
<!--kg-card-end: markdown--><p>El como hacerlo depender&#xE1; de cada servidor HTTP que se utilice pero voy a poner unos ejemplos:</p><!--kg-card-begin: markdown--><p>Nginx</p>
<pre><code>server {
    location / {
      add_header Permissions-Policy interest-cohort=();
    ...
    }
}
</code></pre>
<p>Caddy</p>
<pre><code>server.com {
    header {
        Permissions-Policy &quot;interest-cohort=()&quot;
        }
    ...
}
</code></pre>
<p>Apache</p>
<pre><code>&lt;IfModule mod_headers.c&gt;
  Header always set Permissions-Policy: interest-cohort=()
&lt;/IfModule&gt;
</code></pre>
<p>HAProxy</p>
<pre><code>http-response set-header Permissions-Policy interest-cohort=()
</code></pre>
<p>Traefik</p>
<pre><code class="language-yml">http:
  middlewares:
    disable-floc:
      headers:
        customResponseHeaders:
          Permissions-Policy: &quot;interest-cohort=()&quot;
</code></pre>
<!--kg-card-end: markdown--><p>Si no puedes modificar las cabeceras HTTP por que sitio esta alojado por un tercero se puede desactivar a&#xF1;adiendo este fragmento HTML al &lt;head&gt; de cada p&#xE1;gina.</p><!--kg-card-begin: markdown--><pre><code class="language-html">&lt;meta http-equiv=&quot;Permissions-Policy&quot; content=&quot;interest-cohort=()&quot;/&gt;
</code></pre>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[Bloquea todos los anuncios en Twitch.tv]]></title><description><![CDATA[Bloquea todos los anuncios de los streams en Twitch.tv utilizando las funcionalidades avanzadas de Ublock Origin.]]></description><link>https://blog.paesa.es/bloquear-anuncios-en-twitch-tv/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fda</guid><category><![CDATA[anuncios]]></category><category><![CDATA[privacidad]]></category><category><![CDATA[publicidad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Wed, 14 Apr 2021 20:02:00 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/caspar-camille-rubin-DrL-cwqD6tM-unsplash-1.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/caspar-camille-rubin-DrL-cwqD6tM-unsplash-1.webp" alt="Bloquea todos los anuncios en Twitch.tv"><p>Bloquear los anuncios en Twitch.tv no es tan sencillo como en otros sitios que simplemente con instalar una extensi&#xF3;n como <a href="https://github.com/gorhill/uBlock">Ublock Origin</a> es suficiente para deshacerse de ellos. </p><p>Twitch.tv emplea varios mecanismos para detectar y evadir los bloqueadores de anuncios, como incluir el anuncio dentro de la emisi&#xF3;n de video para dificultar su identificaci&#xF3;n. Adem&#xE1;s si Twitch detecta que se est&#xE1;n bloqueando mostrar&#xE1; una pantalla morada durante la duraci&#xF3;n del anuncio que impide ver el stream y pide al usuario que elimine todo el software que interfiera con el sitio.</p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/How-will-Twitch-_Purple-screen-of-death_-affect-the-streaming-industry_.webp" class="kg-image" alt="Bloquea todos los anuncios en Twitch.tv" loading="lazy" width="843" height="476" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/How-will-Twitch-_Purple-screen-of-death_-affect-the-streaming-industry_.webp 600w, https://blog.paesa.es/content/images/2022/05/How-will-Twitch-_Purple-screen-of-death_-affect-the-streaming-industry_.webp 843w" sizes="(min-width: 720px) 720px"><figcaption>Pantalla que muestra Twitch al detectar un Ad-Blocker</figcaption></figure><p>Voy a mostrar un m&#xE9;todo que elimina los anuncios y el aviso morado, recuerdo que Twitch intenta de forma agresiva anular o inutilizar todas las formas que utilizan los usuarios para bloquear sus anuncios y este m&#xE9;todo puede dejar de funcionar en el futuro.</p><p>Primero es necesario tener instalada la extensi&#xF3;n <a href="https://github.com/gorhill/uBlock">Ublock Origin</a> y activar las opciones avanzadas.</p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2021-04-14-214012.webp" class="kg-image" alt="Bloquea todos los anuncios en Twitch.tv" loading="lazy" width="884" height="704" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/Captura-de-pantalla-2021-04-14-214012.webp 600w, https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2021-04-14-214012.webp 884w" sizes="(min-width: 720px) 720px"><figcaption>Habilita las opciones avanzadas</figcaption></figure><p>Accede a las opciones avanzadas dando click a los engranajes que hay al final de &quot;Soy un usuario avanzado&quot;.</p><p>Busca la propiedad <strong>userResourcesLocation</strong> y cambia <strong>unset </strong>por la siguiente url:</p><!--kg-card-begin: markdown--><pre><code>https://github.com/pixeltris/TwitchAdSolutions/raw/master/notify-strip/notify-strip-ublock-origin.js
</code></pre>
<!--kg-card-end: markdown--><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2021-04-14-215407.webp" class="kg-image" alt="Bloquea todos los anuncios en Twitch.tv" loading="lazy" width="1075" height="383" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/Captura-de-pantalla-2021-04-14-215407.webp 600w, https://blog.paesa.es/content/images/size/w1000/2022/05/Captura-de-pantalla-2021-04-14-215407.webp 1000w, https://blog.paesa.es/content/images/2022/05/Captura-de-pantalla-2021-04-14-215407.webp 1075w" sizes="(min-width: 720px) 720px"></figure><p>Ahora ve a la pesta&#xF1;a de Mis filtros y a&#xF1;ade esto en una nueva l&#xED;nea:</p><!--kg-card-begin: markdown--><p><strong>twitch.tv##+js(twitch-videoad)</strong></p>
<!--kg-card-end: markdown--><p>Hemos configurado <a href="https://github.com/gorhill/uBlock">Ublock Origin</a> para que cargue un c&#xF3;digo Javascript en Twitch.tv, este script remplaza los segmentos del stream que contienen anuncios y enga&#xF1;a a Twitch indicando que los esta viendo correctamente.</p><p>Para terminar reinicia el navegador y disfruta de los streams sin anuncios.</p>]]></content:encoded></item><item><title><![CDATA[Desinstalar aplicaciones preinstaladas en Android]]></title><description><![CDATA[Desinstala las aplicaciones que vienen preinstaladas en tu teléfono Android para mayor privacidad y menor consumo de batería.]]></description><link>https://blog.paesa.es/desinstalar-apps-preinstaladas-en-android/</link><guid isPermaLink="false">6287a5cd2dfe040001ce2fd3</guid><category><![CDATA[android]]></category><category><![CDATA[privacidad]]></category><dc:creator><![CDATA[Daniel Paesa]]></dc:creator><pubDate>Sun, 07 Mar 2021 17:39:30 GMT</pubDate><media:content url="https://blog.paesa.es/content/images/2022/05/rami-al-zayat-w33-zg-dNL4-unsplash.webp" medium="image"/><content:encoded><![CDATA[<img src="https://blog.paesa.es/content/images/2022/05/rami-al-zayat-w33-zg-dNL4-unsplash.webp" alt="Desinstalar aplicaciones preinstaladas en Android"><p>Actualmente los sistemas Android tanto en tel&#xE9;fonos como en tabletas y televisiones llevan incluidas decenas de apps preinstaladas por el fabricante, algunas forman parte de la capa de personalizaci&#xF3;n que estos fabricantes han desarrollado sobre la versi&#xF3;n &apos;vanilla&apos; del sistema Android que es de c&#xF3;digo abierto bajo el proyecto <a href="https://source.android.com/">AOSP</a> (Android Open Source Project) para a&#xF1;adir o sustituir funcionalidades y hacer sus dispositivos m&#xE1;s atractivos al consumidor.</p><p>Estas apps preinstaladas que van desde servicios propios del fabricante como tiendas de aplicaciones alternativas, almacenamiento en la nube, apps de &apos;seguridad&apos;, navegadores... hasta apps de terceros como Google, Facebook, Amazon... no se pueden desinstalar y en muchos casos ni deshabilitar desde los ajustes de Android.</p><p>No solo ocupan espacio en tu dispositivo, muchas se ejecutan en segundo plano consumiendo esa preciada bater&#xED;a y aunque no las abras nunca est&#xE1;n recopilando datos sobre ti y tu uso del tel&#xE9;fono de forma abusiva para poder monetizarlo m&#xE1;s all&#xE1; de la compra del dispositivo.</p><p>Vamos a ver como se pueden quitar estas apps sin tener que &apos;rootear&apos; el sistema. Lo primero es activar las opciones de desarrollador, un men&#xFA; que esta oculto por defecto que tiene opciones avanzadas y herramientas &#xFA;tiles para los desarrolladores de Android. Para activar este men&#xFA; hay que ir a Ajustes -&gt; Informaci&#xF3;n del tel&#xE9;fono y &#xA0;pulsar repetidamente sobre el campo &apos;N&#xFA;mero de compilaci&#xF3;n&apos; o similar (no todas las variantes de Android son iguales) hasta que salga un mensaje de que las opciones de desarrollador est&#xE1;n activadas.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/informaci-n-de-software.webp" class="kg-image" alt="Desinstalar aplicaciones preinstaladas en Android" loading="lazy" width="714" height="1296" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/informaci-n-de-software.webp 600w, https://blog.paesa.es/content/images/2022/05/informaci-n-de-software.webp 714w"></figure><p>Lo siguiente es activar la depuraci&#xF3;n USB en las opciones de desarrollador y conectarlo al PC en modo de transferencia de archivos.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/depuraci-n-usb.webp" class="kg-image" alt="Desinstalar aplicaciones preinstaladas en Android" loading="lazy" width="720" height="1490" srcset="https://blog.paesa.es/content/images/size/w600/2022/05/depuraci-n-usb.webp 600w, https://blog.paesa.es/content/images/2022/05/depuraci-n-usb.webp 720w" sizes="(min-width: 720px) 720px"></figure><p> En un par segundos el tel&#xE9;fono preguntar&#xE1; para permitir a ese PC utilizar la depuraci&#xF3;n por USB. Esto nos dar&#xE1; acceso a muchas funciones de Android utilizando la herramienta <a href="https://developer.android.com/studio/command-line/adb"><em>adb</em></a>. Se puede descargar para Windows Mac y Linux desde <a href="https://developer.android.com/studio/releases/platform-tools?hl=es-419">aqu&#xED;</a>.</p><figure class="kg-card kg-image-card"><img src="https://blog.paesa.es/content/images/2022/05/allow-usb-debug.webp" class="kg-image" alt="Desinstalar aplicaciones preinstaladas en Android" loading="lazy" width="393" height="541"></figure><p>Para comprobar que est&#xE1; bien configurado y detecta el dispositivo:</p><!--kg-card-begin: markdown--><pre><code>adb devices
</code></pre>
<!--kg-card-end: markdown--><p>Que tiene que mostrar algo como:</p><!--kg-card-begin: markdown--><pre><code>List of devices attached
12f399d1        device
</code></pre>
<!--kg-card-end: markdown--><p>Las aplicaciones en Android utilizan notaci&#xF3;n inversa de nombres de dominio, por ejemplo Whatsapp se llama &apos;com.whatsapp&apos;, &#xA0;la app de Youtube es &apos;com.google.android.youtube&apos; &#xA0;y OneDrive es &apos;com.microsoft.skydrive&apos;.</p><p>Para ver la lista de todas las apps instaladas:</p><!--kg-card-begin: markdown--><pre><code>adb shell pm list packages
</code></pre>
<!--kg-card-end: markdown--><p>Para esta prueba estoy utilizando un tel&#xE9;fono Xiaomi que contiene unas 300 apps, ahora hay que identificar cuales pueden ser eliminadas.</p><p>Los servicios preinstalados de Facebook son &apos;com.facebook.services&apos;, &apos;com.facebook.system&apos;, &apos;com.facebook.katana&apos; y &apos;com.facebook.appmanager&apos;. </p><p>El comando para desinstalar el primero ser&#xED;a:</p><!--kg-card-begin: markdown--><pre><code>adb shell pm uninstall -k --user 0 com.facebook.services
</code></pre>
<!--kg-card-end: markdown--><p>Entre las apps preinstaladas del fabricante esta el navegador Mi Browser (com.mi.globalbrowser) de Xiaomi que tiene una <a href="https://www.forbes.com/sites/thomasbrewster/2020/04/30/exclusive-warning-over-chinese-mobile-giant-xiaomi-recording-millions-of-peoples-private-web-and-phone-use/">curiosa</a> <a href="https://www.bleepingcomputer.com/news/technology/xiaomi-tracks-private-browser-and-phone-usage-defends-behavior/">relaci&#xF3;n</a> <a href="https://palant.info/2020/05/04/are-xiaomi-browsers-spyware-yes-they-are.../">con</a> <a href="https://twitter.com/cybergibbons/status/1255969992123863041?s=20">la</a> <a href="https://www.androidauthority.com/xiaomi-mi-browser-privacy-1120707/">privacidad</a>. El servicio de la red de anuncios de Xiaomi (com.miui.msa.global), las anal&#xED;ticas de uso (com.miui.analytics) o Quick Apps (com.miui.hybrid y com.miui.hybrid.accessory) que fue <a href="https://gadgets.ndtv.com/apps/news/xiaomi-quick-apps-update-blocked-google-play-protect-2135165">bloqueada</a> por la Play Store por espiar al usuario.</p><p>Es <strong>muy </strong>importante saber que es cada cosa antes de desinstalarla o podr&#xED;a afectar al funcionamiento del dispositivo. Ten en cuenta que una futura actualizaci&#xF3;n del sistema podr&#xED;a reinstalarlas y tendr&#xED;as que repetir el proceso.</p>]]></content:encoded></item></channel></rss>
